blast
bomb
kill
soldier
die
wound
travel
military
bus
barracks
lagos
person
include
police
sergeant
dispute
rival
ekori
community
seek
traditional
title
revenge
attack
communal
clash
thursday
relate
body
miss
quell
violence
ijaw
militia
found
battle
militant
youth
shootout
doctor
nurse
beat
state
weekend
member
security
service
national
association
resident
nigeria
injure
explode
shot
fire
abraham
deputy
chairman
largest
opposition
coalition
drive
heart
business
district
suffer
minor
injury
leader
target
regime
thousand
local
government
indigenes
storm
sokoto
house
protest
proposal
lga
merge
zamfara
student
riot
school
fee
university
enugu
campus
nsukka
party
associate
rob
gunman
would-be
kidnapper
north
spate
politician
group
set
telephone
exchange
officer
union
death
fight
break
gather
allege
change
tuition
nineteen
land
warri
prayer
meeting
mark
end
ramadan
open
control
crowd
shiite
muslims
marcher
stone
weapon
witness
report
shiites
source
confront
hoist
flag
central
mosque
arm
robber
church
nigerias
southern
delta
information
provide
dead
arrest
nigerian
armed
force
village
retaliation
kidnapping
personnel
follower
cult
follow
town
pass
french
oil
engineer
shoot
driver
refuse
pay
bribe
road
checkpoint
logo
base
businessman
home
catholic
priest
unknown
man
christian
religious
paralyze
southeastern
calabar
tire
manufacturer
close
factory
worker
increase
election
primary
oppose
ongoing
fighting
ethnic
osun
twenty
foreigner
american
britons
hold
tribesman
platform
coast
official
allegedly
raid
office
institute
human
humanitarian
law
port
harcourt
seize
detain
organization
secretary
municipal
river
woman
rioting
call
release
moshood
abiola
jail
polling
station
tear
gas
rioter
claim
vote
fraud
attacker
staff
royal/dutch
shell
corporation
ransom
"operation
sweep"
combine
anti-crime
task
navy
anger
tribe
relocate
headquarters
itserki
royal
dutch/shell
hostage
hurt
barrel
day
bpd
crude
fear
relocation
part
urhobo
belong
civilian
company
area
sporadic
period
week
leave
declare
supporter
political
involve
re-run
poll
itsekiri
light
overnight
oil-rich
niger
hundred
embark
peaceful
demonstration
suspension
newly
elect
council
nomination
chief
burn
fifteen
seventy
beroms
hausa
immigrant
discover
kinsman
assume
responsible
accuse
itsekiris
coastal
son
murder
post
main
market
vehicle
burnt
continue
boat
kidnap
captain
dockworkers
loader
ltd.
private
british
firm
contract
strike
demand
severance
totalling
year
worth
wage
finally
movement
region
troop
deploy
restore
order
recent
policeman
kano
lasu)
temporarily
lasu
contest
dozen
spread
nearby
warring
torched
renew
interethnic
suspect
await
trial
prison
torture
stampede
soccer
arson
raze
large
onitsha
biggest
teargas
child
detonate
truck
ijaws
villager
bassambiri
gain
attention
briefly
shut
ibadan
injures
minister
eastern
charles
steal
luxury
car
cattle
grazing
northeastern
naval
battalion
operation
spark
arresting
harass
damage
civil
servant
kaduna
indefinite
non-payment
promise
allowance
medical
transport
war
girl
polytechnic
street
due
fuel
shortage
magazine
violent
secret
benin
liberation
army
illegal
activity
neighboring
installation
female
bystander
nadeco
young
boy
thirty
hospitalize
reason
erupt
bayelsa
customer
purchase
amount
alcohol
seller
islamic
extremist
fare
price
burned
building
automobile
auspice
nans
abachas
bid
remain
divisional
snatch
prisoner
ogoni
begin
hunger
international
solidarity
continued
imprisonment
destruction
sixty
place
center
defuse
alive
ife
modakeke
toll
kokori
past
fail
compensation
pro-democracy
campaigner
hope
turn
presidential
contender
birthday
lock
palace
family
launch
teacher
injured
king
aim
convoy
governor
ekiti
unigersity
rally
demonstrate
support
administration
denounce
ado-ekiti
occupy
rig
mobil
corp
southeast
mother
communication
olanrewaju
gang
moslem
parade
northern
city
wednesday
eclipse
moon
host
ambassador
forcibly
stop
frederick
span
people
committee
chairmans
destructive
explosion
power
ally
aboard
chase
operator
gelegele
production
jukun
chamba
kutep
removal
elected
editor
ikeja
ten
response
dissolution
previous
fresh
produce
giant
dutch
cut
output
percent
nembe
creek
facility
vandalize
flow
akure
ekakpamre
carry
earlier
threat
forced
closure
ughelli
west
improved
access
share
typical
tribal
conflict
machete
suggest
mercenary
involvement
prevent
lack
water
electricity
employee
elf
petroleum
harcourtto
work
condition
pack
explodes
intersection
destroy
monarchs
estate
friday
ahead
intend
prematurely
populated
raise
peace
nnamdi
azikiwe
airport
western
houseboat
ondo
peacefully
general
shehu
yaradua
twelve
coup
plot
current
ruler
sani
abacha
recover
adjacent
otin
ogani
mosop
live
ammunition
bori
detention
activist
hotel
assault
rape
custody
displace
taraba
farmer
fulani
run
alapata
toro
tree
protestor
seal
spill
shop
ile-ife
muslim
ground
katsina
unite
middle
east
demonstrator
ibrahim
insult
overtake
full
passenger
valuable
highway
borno
chadian
border
subsequently
experience
hand
self-defence
unit
respond
chad
gubio
assailant
embassy
repulse
guard
journalist
abuja
action
democracy
uad
effort
disperse
rule
eventually
loyalist
protester
ban
ilorin
tuesday
wait
hour
scarcity
problem
abdul
maliki
kwara
television
detachment
attempt
cover
advocacy
press
freedom
wear
uniform
ambush
ride
rural
loot
oboro
mourner
bury
relative
victim
intervene
motorist
send
unrest
neglect
unharmed
cameroonian
opening
front
territory
bakassi
peninsula
south
country
pro
severely
dictatorship
drug
reportedly
monday
night
immediately
busy
predominantly
sabo
ife-ife
parliamentary
predominately
neighbourhood
dictator
boycott
lead
stadium
traffic
abuse
gen
olusegun
obasanjo
olisa
suspend
agree
grievance
block
organize
bow
arrow
roadblock
ilaje
citizen
million
naira
abubaker
appoint
air
voice
figure
gani
collapse
overcome
put
abubakar
extortion
fewer
rebel
republic
gun
special
squad
zaki
outfit
commander
skirmish
stage
anti-government
property
news
dissident
free
ownership
missionary
plateau
fourteen
president
critically
field
threaten
fishing
money
commercial
high
cost
trigger
accident
breaker
renewed
spur
prominent
wave
export
manufacture
italian
agip
job
fifty
refusal
trade
tax
levy
detained
manager
bank
extend
justice
fair
recognition
takeover
disputed
angry
environmental
thirteen
sect
incarcerated
compatriot
behead
piece
rich
tanker
argument
maintain
plant
saturday
crew
vandal
disrupt
helicopter
make
push
engage
borna
shield
joint
belgian
month
incident
payment
monthly
minimum
chevron
escravos
pipeline
occur
initial
result
sweep
applicant
scene
respective
origin
recruitment
mount
voting
card
pastor
worshiper
vigil
arrears
salary
dispatch
texaco
westminster
dredging
ancestral
effectively
amenity
autonomy
24th
sign
agreement
talk
gathering
suburb
abule
assassination
trader
avenge
opc
morning
premise
reinstatement
consultant
assassin
briton
abduct
foreign
compensate
secondary
bottle
african
st
joseph
college
degree
ceremony
presence
alhaji
azeez
occasion
development
aid
donate
section
key
stone-throwing
fisherman
small
southwest
n5,200
academic
asuu
branch
institution
implementation
structure
shuts
protect
bonny
island
effect
lawyer
establishment
court
appeal
division
inebriated
rider
hire
obstruct
ballot
box
axis
explosive
dangerous
igbo
audu
ogbe
early
yesterday
survive
hurl
wife
mrs.
mr.
sacking
ayodele
october
three-month-old
baby
brother
father
independent
electoral
commission
oju
benue
barricade
gate
administrator
capt
dismissal
oyo
pursue
december
suspected
disguise
herdsman
isoko
sink
neighbour
ilajes
personal
assistant
david
oturkpo
chapter
oodua
congress
pump
product
captive
yenegoa
ultimatum
meet
organisation
violation
hrw
detail
bring
total
reversal
custom
agent
stay
agency
withdraw
march
killing
kaiama
occupation
shooting
yenagoa
procession
agriculture
makurdi
alleged
colleague
arrive
terminal
petrol
venue
south-south
convention
democratic
pdp
herder
disagreement
nation
health
federal
upgrade
yoruba
gasoline
mob
efon
mushin
elderly
major
residence
solomon
alliance
deadline
impose
eket
casualty
refinery
site
fan
loss
world
reprisal
previously
act
demolition
illegally
construct
housing
join
anambra
tens
flee
motorcycle
vigilante
repair
operate
medium
john
musa
maiduguri
april
publishing
publish
standard
newspaper
nigeri-an-chadian
neighbor
cross
indefinitely
usage
gunboat
rifle
6th
70-year-old
sack
plc
regular
lacoped
start
false
rumor
crime-bursting
udu
uvwie
enerhen
effurun
kafanchan
intention
supervise
retired
recently
kawo
minute
pension
appointment
vigilantes
lynch
senior
ndlea
enforcement
thief
registrar
gunfire
sunday
watch
dealer
looting
ware
ikwere
express
ministerial
list
favour
interest
animal
technology
"unnecessary
construction
julius
offshore
board
herdsmen
blame
june
gwoza
northeast
youths
adamawa
inflict
number
inhabitant
orderly
violently
dislodge
expatriate
contractor
responsibility
widow
orphan
minded
assembly
pray
legislator
junior
department
vice
chancellor
decision
management
handle
capture
fund
obafemi
awolowo
invade
blockade
round
dawn
perpetrate
drilling
osogbo
forcefully
senator
waziri
app
shagamu
heel
russian
hausas
feld
escape
sagamu
descend
throw
shelter
aguleri
long-standing
feud
counterpart
riverine
sport
tony
repel
ilajaes
numbering
umbrella
residential
quarter
aba/port
welfare
unionist
public
propose
lawmaker
move
capital
hike
shoot-out
deny
anti-riot
radio
broadcasting
sale
motor
vice-chancellor
apapa
apparent
rampage
tiv
ukum
align
tivs
situate
stab
indiscriminate
retaliatory
strip
naked
aggrieved
bolori
roundabout
secretariat
unpaid
rapid
n20
ogun
ago-iwoye
liquefied
natural
okada
inspection
permit
insurance
helmet
fine
club
slum
portion
km
kuteb
funeral
proceed
disruption
adoption
sharia
legal
system
yorubas
obasanjos
oil-producing
drop
team
sponsor
odi
greater
profit
striker
incite
uprising
nov.
victoria
imam
hostile
foster
good
relation
scream
late
charge
faction
systematically
unarmed
november
engineering
companys
manage
director
offensive
hideout
lay
suburban
inauguration
unidentified
conduct
house-to-house
landlord
isolo
long
blackout
nepa
opobo
employ
dredge
limit
employment
quota
impact
assessment
narrowly
radical
hospital
planned
bill
plan
subsidy
fraction
ad
celebration
adopt
tear-gas
ensue
encounter
eat
crop
arabic
entire
converge
publicly
police/military
massob
strict
aba
christians
a.m.
calls
mass
introduction
imposition
spiral
neighbouring
kachia
walijo
february
inquiry
side
divide
connection
curfew
roman
igbos
ibos
refugee
northerner
owerri
enter
uyo
inter-religious
rumour
smash
3rd
7th
life
surround
escort
ship
sailor
overpower
ransack
damboa
buy
build
breach
prior
futo
hostility
kidnaps
ablaze
commuter
identification
ibeno
exxon
vessel
lagos-ibadan
expressway
separatist
owo
struggle
headman
senate
deem
twon-brass
saleh
judge
dahiru
lagos-abeokuta
ranking
suspicion
ibibio
efik
settlement
boundary
akwa
ibom
coordinator
actualization
sovereign
biafra
militias
citys
narayi
co-religionist
decide
year-old
ritualistic
fashion
hack
criminal
bloodshed
succession
leadership
stool
fatality
councilor
reduce
tenure
indian
executive
motive
unclear
taxi
volatile
chinese
industry
onne
content
christian/muslim
sharing
wealth
militiamen
awka
clean
corp.
halt
form
displeasure
crash
candidate
layi
balogun
burst
ibo
heavy
bandit
scale
wall
fence
(ncs)
duty
firearm
reaction
sharp
okon
sustain
dread
gunshot
anti-libya
focus
nigerians
libya
og
install
exploit
tension
fulanis
cameroon
matter
exploitation
recourse
torch
abakpa
demonstrating
position
exclude
event
rid
week-long
siege
badagry
gboko
stake
cement
bursary
eleven
herd
wander
wrong
patch
track
nomadic
cow
distribution
lagso
israeli
beer
parlour
sight
africa
safety
nomad
barely
similar
participate
nationwide
time
ajigin
controller
immigration
ke
ogba
speaker
exercise
visit
gombe
learn
remote
save
situation
location
black
axe
vikings
northwestern
approximately
inspector
bloody
chadians
inspector-general
fact
stock
alcoholic
drink
economy
agege
odimodi
linger
benus
enforce
"ecomog"
physical
konduga
kumo
mar
beggar
emir
square
chamber
commerce
staffer
ushongo
spdc
lafia
n3
n1.6
process
catch
ikorodu
jos
implement
unsubstantiated
sixteen
represent
superintendent
attach
cultist
degema
representative
berom
fulani/hausa
offence
walk
evening
regional
boss
inmate
inside
ikot
ekpene
pilot
infighting
okrika
split
lose
cash
differ
viewpoint
u.s.
afghanistan
councillor
describe
unjustifiable
yobe
qunut
retreat
anglo-american
asian
accompany
banki
petition
ago
resist
commissioner
conference
striking
red
render
specialist
commencement
cite
broadcast
mobile
industrial
bad
labour
command
yaba
show
electric
authority
preacher
fundamentalist
profile
ministry
delay
hadejia
biseni
traveler
bola
eighteen
officially
labor
danja
armory
erupts
trans-border
cross-border
crime
commit
route
link
bauchi
jigawa
oshodi
head
mission
retaliate
critic
muhammadu
buhari
anpp
atiku
kure
yemi
jimeta
terror
kebbi
avert
veteran
wase
ethno-religious
(unknown
faith
corrupt
schoolgirl
izzi
gusau
cutlass
masquerade
yelwa
accord
argue
stabbing
angwan
galambi
congo
point
directing
befriending
nddc
pond
loko
opponent
owa
rock
irate
motorcade
top
potiskum
bullion
van
awo
anpp.
corporal
unprovoked
individual
abia
apartment
edo
steals
babangida
unleash
formally
outlaw
zaria
announcement
win
undergraduate
forty
langtang
barkin
ladi
defense
properly
mistakenly
inhabit
pirate
print
unfavorable
article
burning
perceive
blasphemous
chritians
score
estimate
gubernatorial
aspirant
mask
sea
wuse
register
riyom
extra-judicial
present
wukari
bello
minna
firefight
malam
aminu
ahmed
robbery
deep
safeguard
mala
lake
nlc
level
series
okere
confirm
funmi
polices
obubra
inuwa
abakaliki
kwande
offical
secure
rearers
dumne
song
code
evacuate
campaign
peter
diffuse
regain
ezza
incur
aso
warrior
bakana
imo
pdp.
spray
breakup
entourage
nun
react
clear
n4
arsonist
daughter
park
population
okitipupa
upcoming
governorship
toto
nasarawa
booth
kikyo
lga.
harry
marshall
politically
motivated
kogi
gwari
doma
akande
supply
festival
back
nurtw
motorcyclist
collection
operational
barawa
militiants
senatorial
benin-city
lokoja
abonnema
motivate
agbor
prp
ebonyi
ans
innocent
question
pend
investigation
duel
waterway
canister
brawl
mine
pandemonium
fierce
trouble
stem
forcados
abuja-kaduna
bama
bridge
ambrose
alli
okwagbe
ijora
provoke
george
bush
blasphemy
rescue
affair
consulate
patani
presume
depot
geidam
kanama
islamist
establish
bear
word
kanamma
kilometer
mile
damaturu
mahairun
surge
eve
reinforcement
band
al
fighter
create
targeted
challenge
strand
airline
clan
monarchy
breakdown
post-election
give
victory
search
hoodlums
specific
invades
theft
yamini
lakushi
sabon
ajikamai
compound
cocin
tit-for-tat
return
shendam
longvel
karkashi
gov.
akume
airway
andrew
mopol
nassarawa
eggon
unhurt
sit
stray
bullet
koran
allocation
rise
demo
faculty
suspicious
circumstance
raider
tarok
bashiru
a.
lodge
magumeri
caretaker
apparently
weekly
vendor
three-day
royalty
contininuing
noon
repeatedly
captor
intense
supposedy
july
bakin
emergency
harassment
marketplace
jailbreak
ecomog
berserk
medicine
sacked
thug
hall
sectarian
height
dismiss
frma
popular
chieftaincy
issuance
anti-labour
restaurant
poor
ngo
muslim-christian
rush
assist
hill
refuge
shuwa
pensioner
abducting
mud
kala-balge
informant
flight
address
witch
observe
higher
butcher
failure
logistics
hear
privatize
mining
miner
sunni
lebanese
togolese
ruling
monarch
benefit
sunnis
rustlers
steel
organizes
unspecified
shift
el-rufai
derivation
cold
violate
crusade
secession
device
locally
by-election
aide
anniversary
ndpvf
ritual
trail
accountant
policy
vary
account
ward
gunfight
accuses
corruption
recapture
plane
deadly
onicha
centre
seme
fish
jtf
publication
cartoon
prophet
mohammed
afp
minority
condemn
european
add
chant
suppose
receive
treatment
teaching
scuffle
happen
jere
adhoc
daily
trust
resolve
blow
mend
tom
razes
ateke
loyal
turf
korean
corps
nightclub
survival
nationality
marketer
nigerien
repels
addition
clashing
detonates
filipino
shani
ali
modu
sheriff
[é
asset
maim
impunity
declaration
identify
reporter
(nta
crisis
administrative
costain
affiliation
retrieve
comrade
camp
russians
indians
corpse
white
saidu
partiality
handling
ticket
abducts
soku
desecrate
derrick
envelop
smoke
dikwa
mafoni
voter
telecom
defend
crowed
mend.
patron
jetty
pregnant
engages
eni
overrun
witchcraft
unpopular
metropolis
turkish
umar
rabiu
abduction
determine
homemade
professor
supervisor
deal
badly
colombian
mustapha
tela
primarily
vigilance
gberesaakoo
pre-election
employer
daewoo
vice-president
umaru
fetish
killer
telecommunication
channel
august
buharis
exxonmobil
en
exam
rampaging
allegation
vandalism
bulabulin
kanuri
patrol
farmland
equipment
disrupts
idanre
assassinate
economic
cleric
rev.
fr
ikpiki
speedboat
imminent
german
ezillo
winner
chairmanship
chibok
sheet
display
placard
plight
grant
promotion
issue
grandmother
dress
factional
clough
asaba
history
prince
hijack
funtua
ogbia
industrialist
nscdc
jurisdiction
retaliates
gangster
paul
ogundeji
ooni
dpo
coordinated
overran
dr.
yet-to-be
actor
range
affect
ganye
ijebu
film
video
firing
olabisi
onabanjo
iselegu
ibabu
mallam
buba
ethnic/religious
line
melee
hausa-fulani
god
kingdom
society
lecturer
nysc
akumoni
ayamabele
passage
alaba
lawson
abagana
jukuns
takum
cultural
governmental
hassan
amai
insecurity
nkanu
transit
step
motorbike
fill
sabotage
pastoralist
disarm
surrender
canadian
volunteer
delayed
hijacking
stateõs
gbramatu
oporoza
okerenkoko
machine-gun
low-flying
amnesty
foil
irin
eye
frequent
outage
gunbattle
crossfire
frsc
anti-robbery
intercept
boko
haram
fatal
deregulation
owe
egbema
slain
atlas
cove
countrys
harams
pro-sharia
stricter
yusuf
quickly
tactic
crossing
instigate
ijebu-ife
israeli-palestinian
gaza
blood
cart
palestinian
waje
high-handedness
insensitivity
education
destroys
altercation
precise
resume
distress
ac
cooperation
blind
clashed
cargo
dock
waterfront
prepare
pave
project
coma
sars
nnpc
provocation
farm
udeni
gida
udobor
undisclosed
energy
disgruntled
complain
whip
re-election
ovia
require
verification
award
scholarship
affiliate
ritualists
remove
unnamed
vice-chairmanship
slate
kwali
(fct)
gwagwalada
sng
absence
illness
affa
umuoka
inec
owner
speed
mastermind
date
recall
january
proposed
grammar
bukuru
pre-dawn
rove
worship
24-hour
kuru
karama
tim-tim
gidan
kanar
forum
dogo
nahawa
vom
numerous
du
barkini
warend
kerena
lgas
datum
collect
prolonged
specifically
villiages
villiage
mangu
cdhr
technical
(ac
ill
transfer
umuahia
bureaucratic
outbreak
habit
terrorism
ail
ak-47
vie
homeless
item
coygg
ex-militants
abandonment
ak-47s
udeni-gida
wadata
n10,000
dadiya
kaltungo
execution
style
purpose
entrance
inclusion
bomber
broad
network
leg
read
vengeance
havoc
destroyed
pm
blair
financial
efcc)
investigate
case
desopadec
unexploded
egbesu
na
hawa
disappear
adult
brutal
zot
ratsat
kutgot
burial
strife
trap
net
acting
urban
jonathan
dissolve
cabinet
villa
tongue
aviation
wield
wooden
incessant
sympathetic
nulge
brutality
npdc
abraka
lecture
torching
twin
lastma
enough"
trigger-happy
hunt
barako
nwebiara
suicide
tai
solarin
draft
constable
assign
bukar
abba
marketing
ppmc)
friend
couple
arik
ram
aircraft
federation
calm
junction
operative
rimi
militiaman
feed
syrians
fellow
prefer
correspondent
seat
transportation
room
reform
ensure
credible
grenade
crowded
passersby
passerby
witch-hunting
preferred
countless
attribute
severe
jie
teenager
bearer
active
inability
write
impeach
partys
persecution
james
inori
attempted
invitation
impeachment
proceeding
amambra
nafdac
banner
nuj
collogues
load
peremobowei
ebebi
trading
flood
assistance
convey
deposit
north-east
incumbent
locate
find
float
pour
london
communitys
state-owned
non-implementation
table
approve
(rtean
embattled
face
direct
apprehend
panic
17th
saraki
bodyguard
attend
postal
indebtedness
timber
sapele
speedboats
carrier
hostel
strong
nps)
retiree
retirement
manhandling
hon
bar
complex
yola
adamu
tanko
popularly
inciting
comment
zonal
zone
toyota
riddle
patrick
announce
utako
restive
unaccounted
placard-carrying
football
chanting
goodluck
jonathans
organise
training
abeokuta
processing
adequate
nuj)
n250
hajiya
oust
arewa
foundation
jonathon
coming
wounded
(jtf
phcn)
bomadi
jump
avoid
drown
shia
deployment
progress
constituency
ii
protection
rerun
stronghold
aegis
basic
term
examination
ika
nonye
ndokwa
phcn
epileptic
serve
convert
science
exclusion
programme
marine
resource
four-man
nupeng
embarks
sector
zuru
aliyu
shinkafi
yerima
ayo
expulsion
islam
complete
peopleõs
progressive
lekki
ajah
concession
concessionaire
forceful
scheme
10-year-old
garba
finance
combined
ado
accept
hub
originally
significant
outlawed
resort
guerrilla
warfare
waylay
tafawa
balewa
forest
outskirts
abductor
parliament
influential
guardian
isa
yuguda
separate
hamza
al-mustapha
hit-and-run
motorcycle-riding
heavily
asuu)
dog
mrs
defunct
unity
catholics
plague
unijos
controversial
brandish
intelligence
spokesman
offer
islamists
eyewitness
apply
sa
thai
abducted
fringe
independence
non-inclusion
outspoken
alarm
night-time
off-duty
tukur
shortly
peak
feuding
nsadop
boje
boki
10km
kalashnikov
stable
clinic
okoro
adviser
dynamite
zinnari
sporadically
worshipper
wahabi
jajere
bulunkutu
seven-day
warning
maltreatment
egyptian
pursuit
ndlf
nwachukwu
record
emerge
jtf.
christmas
baptist
alamderi
amid
hit
native
notorious
arrival
material
note
alludes
nurtw.
edge
clothes
theatre
malpractice
unsuccessful
orogun
open-air
tavern
wedding
"many
treat
wareng
delegate
pattern
billboard
erect
outcome
scamper
vanguard
shabu
object
largely
feel
marginalizies
organiser
aprils
registration
disturbance
displease
whereabouts
biu
farin
lamba
19th
comprise
advocate
irregularity
exit
jong
sunkut
luhana
greek
sheep
rustle
abdulkarim
barkinladi
greet
younger
concern
bag
remote-controlled
methodist
angered
validity
injuries/causalities
check
back-to-back
withdrawal
bias
jonah
jang
spot
shout
slogan
al-makura
gwer
purported
randomly
wild
equally
husband
batter
tense
commemorate
birth
gomari
beating
naka
exact
publicity
vague
"hoodlums
buruku
hideouts
katsina-ala
chest
thigh
"political
gabriel
mr
left
mate
(acn)
gra
acn
substantiate
farming
critical
utility
abdullahi
gmt
kai
kura
fall
plateaus
knock
door
stomach
tour
igumale
mayhem
[pdp
gana
chieftain
store
muhammad
alert
adekaa
bogoro
tyre
heartland
extent
ap
distribute
conclude
allegiance
today
reach
(unnamed
nyanya
impending
cpc
typically
challenger
buhuri
jalingo
bali
gassol
mutum-biyu
manipulation
first-round
rigging
indigenous
causality
gari
zonkwa
plank
bajju
sophisticated
hide
clahses
reverse
direction
mararaba
satellite
fct.
defeat
user
murtala
nyako
dusk-to-dawn
pronounce
mubi
michika
drag
gonin
gora
extrajudicial
bejji
ethnicity
spanning
massive
adherent
kind
widespread
afternoon
initially
grave
òethnically
cleansed
ó
matsirga
maga
maraban
rido
memorandum
submit
recognize
ungwar
touch
nuhu
anghan
zangon
kataf
chikun
kaura
jaba
coordinate
indigene
vast
ethnically
cleanse
fadan
daji
assemble
capacity
workshop
warden
taskforce
routine
accommodation
mukhtar
pedestrian
disturb
kadarko
gwange
ex-militant
warn
improve
hour-long
meter
stand
samuel
abandon
100km
garden
basis
spiritual
garbai
influence
heighten
vaccine
warehouse
parking
lot
extremists
passers-by
powerful
adjoin
play
simultaneously
door-to-door
inadvertently
carpenter
indiscriminately
possess
ibiono
ekpo
harm
grain
alight
chelsea
obi
midnight
laden
dominate
conflicting
hig
ex-police
bombing
lie
crossroad
making
reported
speak
english
drunk
coincidental
tie
populate
barrack
violence-torn
termination
airtel
subscriber
chemical
guinea
roadside
tow
loud
internal
revenue
jerusalem
reveal
parlor
shopping
fulainis
realize
cadet
majority
eid
madalla
confirmed
gathers
teenage
prompt
all-day
expel
perpetrator
food
negotiation
practitioner
non-release
eight-month
view
possibly
drinking
schedule
aftermath
evidence
wake
multiple
insurgents
credit
france
camera
story
ariyo
photojournalist
accidently
causalities
pair
shopper
possession
upset
localized
connect
shipping
botched
bonfire
counter
two-year-old
widely
delivery
improvised
ordinance
retire
kukawa
okunran
egbe
prof.
confiscate
institutionõs
n10
scholar
uncover
successful
calling
notice
arise
spanish
vacate
4th
easter
undetonated
apata
polythene
cache
abu
qaqa
bakery
polo
photographer
sharada
kwanar
infrastructure
bh
motivation
debate
possibility
improvise
substance
household
rijiyar
uncertain
rim
50km
tip-off
ungwan
muazu
low
simply
coincidence
consecutive
metro
merger
expect
execute
strategic
attendee
unknowns
age
ugly
gbenga
artisan
judicial
salami
lament
disengaged
pupil
ifelodun
oba
league
29th
federally
text
otukpo
ahoada
east-west
rage
tricycle
emmanuel
dr
danladi
ire
lorry
leprosy
dormitory
slow
pace
warri-port
player
chair
disclose
lawan
lamisula
resistance
physically
mango
male
successfully
anti
odua
echo
ikenga
ogidi
idemili
mortuary
count
knife
christ
choose
"ex-militants
1am
sleep
demean
n50m
ex-niger
tasha
stick
undermine
speaking
retail
leather
slap
effected
satisfy
gridlock
seizure
slay
nmti
scrap
nab
window
damaging
fagge
virtually
ivo
igwe
seventeen
besiege
regard
deceased
pre-emptive
concentrate
ied
rift
kurna
asabe
mention
gwandu
shamaki
redeployment
mall
publically
and/or
barakin
unincorporated
original
cemetery
birom
religion
sheikh
womens
nkpor
expert
bike
nuee
electrical
interrupt
dispose
downtown
manipulate
shanty
gashish
pub
common
social
negligence
guest
rocket-propelled
assorted
weaponry
till
potable
confederation
ojantele
ijegwu
magistrate
õ
"militant
fix
research
governmentõs
train
deliver
conceal
scare
emirate
threating
confrontation
swear
okordia
counterattack
marte
withhold
september
ummarari
mtn
phone
mast
geographic
telecommunications
photograph
jumaat
egypt
sexual
game
maiha
afikpo
worldwide
israel
enemy
maker
punish
sweeping
uk
infiltrate
agricultural
socialist
jaf
openly
half
nan
lp
xinhua
cancellation
douse
dogon
kuka
biam
delivery/taxi
restriction
thoughtless
machine
armoured
roof
two-story
controlled
rate
immunization
kofar
judgment
cede
speculate
gwaram
assert
praying
tool
classmate
punctuate
5.15pm
intermittently
protracted
zannari
opposite
quarry
shuaibu
straight
11am
participant
closer
status
string
headmaster
ari
salisu
grow
strongholds
tudun
wada
readiness
akuku-toru
interior
rejection
harem
behalf
ceasefire
lieutenant
cell
tower
courier
short
karshi
continuous
molestation
mid-morning
evident
politics
galadima
unimaid
survey
design
eviction
poster
unguwa
uku
babatunde
fashola
insist
omala
abejukolo
sing
sex
ketu
maritime
demarcation
koro
notable
intimidation
tailor
inscription
huge
sum
"in
date(
uncovers
kaleri
sango
ota
succumb
traditionally
"take
sagbama
jos-abuja
outpost
ciki
settler
oruku
umuode
unreported
appointee
"recently
jaji
slit
throat
azare
damasak
shake
interim
okpoama
outskirt
classroom
gere
dala
taiwo
baga
teach
ijebu-ode
hotoro
bypass
zajiri
sneak
unguwar
yield
yankaba
ladipo
unconfirmed
fika
ibn
pro-government
bulama
ruwan
zafi
gaya
parish
frenchman
francis
colump
wing
daniel
splinter
ansaru
switch
flour
mill
identity
graze
40km
foiled
akanu
rigasa
igabi
bolari
3am
learnt
ikere
vehicular
intervention
bayan
sound
4pm
rochas
okorocha
ambushed
birnin
magaji
makera
usu
azuko
kingpin
yanawaki
adadama
fang
"militants
okene
mali
bayero
mechanical
amagu
furniture
hunter
sell
meat
forbid
taroks
mans
gunpoint
ngwa
misunderstanding
treasurer
on-going
offa
resurface
councilõs
parent
gunships
abavo
uche
respect
mini
fct
restrict
nassarawan
burumburum
mararaba-awange
adoja
igah
eggons
aboh
mbaise
ramat
kin
kayode
care
polio
administer
metropolitan
kalla
kassa
array
trailer
aggrieve
gamboru
baba
mai
whisk
destination
pretend
study
forthcoming
aero
awada
consumer
billing
gambaru
britain
lagos-badagry
alausa
non-compliance
inaction
(unincorporated
tambour
p.m.
check-point
escalate
maru
abdulrasheed
maina
supreme
embezzlement
uwheru
invasion
kasuwan
gulak
madagali
danburam
aged
constitution
amendment
hijab
tella
intended
attackers
orji
baderi
mafa
peasant
akin
oke
dump
jajeri
etsako
auchi
replace
guma
bore
hallmark
actual
sterling
manhandle
dakata
1pm
zajeri
umarari
ngala
deceaseds
8pm
nup)
orlu
ieds
wamakko
manufacturing
nickname
pull
"marginalization
ikwo
mid-afternoon
ganmo
ganna
torok
adeke
unarticulated
additional
sanda
atakar
tea
emeka
discuss
directly
twenty-eight
ganawuri
attakar
dajak
traveller
yard
library
rumble
three-hour
bara
rocket
propel
launcher
rtean
jobless
graduate
unemployment
9pm
unyenge
mbo
dual
balwai
armoury
bokkos
pulka
poison
gwale
ungwar-dabai
usman
azuzuama
adaka
terrorise
zango
midlu
mourn
gumel
vandalise
tiv/tarok
regroup
funding
reinstate
blockage
demolish
provost
cent
match
audience
rauf
aregbesola
measure
abadam
dino
melaye
ejigbo
kehinde
bamigbetan
avenue
working
universal
limited
regulation
hinder
sand
tanjol
victor
instance
north-eastern
brush
eze
paramount
emohua
napep
poverty
surulere
churchs
ibaji
adams
oshiomhole
element
dealing
involved
gbagyi
model
initiative
bala
3pm
agwada
estako
igarra
dental
okpara
governance
dsm)
lawanti
bale
introduce
universityõs
shettima
monguno
ankpa
oke-mosan
test
fulfil
"women
otu
bukkuyum
anka
remains
ombatse
alakyo
accidentally
jam
ekwo
agatu
uromi
ogbaru
sambisa
reserve
shelling
proclamation
fm
akinlabi
zabamari
gamboru-ngala
fatori
gashigar
hausari
potential
unhappy
cardoso
karimu
chibuike
amaechi
ndigbara
nature
sss)
permanent
anti-monarch
obosi
shekau
hrazah
hembe
expressly
bende
inyima
yakurr
onyadama
attahiru
aiyo
directive
ð
enugu-onitsha
coffin
dismantle
"exorbitant
temporary
closing
dutse
hole
homosexual
prosecution
courthouse
egor
oredo
ikpoba
hwaa
gathahure
gjigga
clergyman
otedola
overruns
maiduguris
alau
dam
oghara
kizara
limankara
"scores
ilupeju
choice
ojo
ilaro
anguwan
shuwari
marginalisation
visitor
fro
hinge
educational
mainok
magama
28th
ohaji/egbema
fune
zabarmari
midwife
nannm)
bvyg
tiv.
karim
lamido
boarding
advisor
pentioners
non-settlement
entitlement
awe
concerned
attitude
legislation
session
fracas
complaint
unnumbered
guri
(jtf)
bvyg)
sule
kwankwaso
motovation
manchok
el-amin
daggash
screening
sentence
detainee
future
abakaliki-enugu
disability
ashaka
ogijo
akeem
elupepe
harassamet
attackes
dawashe
dawashi
multi-national
mnjtf
anti-boko
tapga
ibi
upper
makurdi-gboko
keana
ascertain
jtf"
karu
multinational
bisagana
marriage
dweller
oshimili
benin-ore
2am
infuriate
bon-fire
ngom
maisarmari
mailari
buguma
gbajimba
northwest
spokesperson
dan
hajia
grabber
torment
asup)
coeasu)
accidental
resolution
wrongful
(stf
aka
non-availability
obiaruku
uhumnwonde
walter
aiwekhoe
ekpoka-igbanke
cooperate
additionally
liberate
lure
yala
kwale
casual
pose
fayemi
opeyemi
bamidele
agena
agbaaye
confusion
bvyg.
bisichi
foron
kudu
rapist
apc
zankang
moroa
ofu
interns
luth
idi-araba
healthcare
"arbitrary
chiefdom
artillery
brigade
related
agencys
nganzai
gajiram
gajiran
anglican
benishiek
70km
holder
plastic
tungar
dorawa
mada
wonaka
subsidiary
buring
mbe
ndoro
utan
brama
effiong
(fce
dismay
"nonchalance
distance
kia
reject
postpone
councillorship
displaced
travelling
banki-bama
kano-maiduguri
accomplice
peruse
kafachan
non-consecutive
paralyse
mistake
foe
nimc)
asari
toru
benisheik
formal
palm
ndi-igbo
enclave
apo
legislative
buni
yadi
"feared
cop
naf
displacement
fulatari
okpagabi
gratuity
zangang
ngamdu
decapitate
kwata
unionize
holding
nation-wide
controlling
muri
efut
seaport
stall
npa
sever
gujba
akoko
eagle
pro-jonathan
detractor
izza
hilly
unfair
practice
textile
pengassan
rubber
enclaves
ajigi
kafa
amir
ede
pandadi
uncle
arepo
mismanagement
maladministration
kukek
asuu,
proper
akoka
kokona
logomani
lectures
ile
honour
alagarno
esuk
companion
olorunda
troubled
anti-corruption
goniri
kawuri
esit
brass
stella
oduah
producing
unlimited
luggage
akanu-ibiam
futa
20km
combatant
completely
conjunction
banking
bauchi-jos
eko
maiwa
8am
maiduguri-damaturu
kaga
firgi
bama-gwoza
jibiya
incarceration
yell
speech
ngoshe
garin
auto
danmarke
ello
ogwule-ankpa
ogbangede
enogaje
okpanchenyi
bdagu
izge
hartsa
yazza
askira-uba
dille
lassa
mobilise
counter-attack
amac
vow
"unlawful
ssanu)
billion
earn
agip/saipem
ashigashiya
oorelope
bitta
comply
efcc
rice
nycn)
enmasse
cancel
fist
wakirike
anti-amaechi
sin
by-pass
riverside
agudama-epie
ezike
igboeze
ethiope
fulani-hausa
acquisition
seplat
dissatisfaction
infidelity
technician
planning
disapproval
inconclusive
parallel
resignation
jega
composite
machinery
ajegunle
garki
undue
coordination
investment
prolong
deji
hilux
eleme
enugu-port
maiduguri-damboa
kurra
decry
counter-protest
reconvene
function
ayetoro
yewa
alaye
bead
saala
pro-chancellor
enejere
unn
fraudulent
bureaucracy
role
hearing
frighten
casualties/injuries
sedge
apc.
inebriate
"invasion
alafa
kwajaffa
tashon
alade
squabble
cab
muhammed
unguwan
dance
acquaintance
removial
urge
govern
sarki
ugborodo
marwa
monoarch
peremabiri
cripple
global
understand
faulty
nba
shonong
domestic
nighttime
gumau
harmonisation
mitv
lawal
invader
phase
replacement
kashim
magnus
abe
south-east
threatening
rumuola
manner
mbiama-yenagoa
ladin
buta
mobilize
presently
outdoor
bornos
simultaneous
discovery
asta
hausaman
"high
handedness
spare
convergence
ogoniland
ogonis
mbu
frozen
cameroonians
okocha
donga
atta
tiv)
oweto
utuluewu
ngawo
grand
apga
defect
wulgo
draw
ikwerre
obio
akpor
njaba
portal
speedy
conviction
courtroom
posse
unregistered
communitiesñonihale
ilepa
aiyede
ñ
ifo
folorunsho
otuaka
judiciary
extra
elder
chakawa
ajao
delegation
adekunle
ajasin
deflate
picket
alagbaka
yamdula
congregation
kajit
adeniran
ogunsanya
aocoed
ijanikin
unlawful
increment
post-graduate
inadequate
"inhuman
"heavy
ngalda
mavo
ugbo
masu
toungo
gero
faskari
mokola
hamper
obio/akpor
investor
jurisdictional
"at
kirchang
kwambula
imago
batik
doug.
9am
gideon
locality
package
lasu,
buratai
gombi
8:30pm
spoke
ishielu
barkin-ladi
mairari
dadin
kowa
christianity
depend
excessive
ilashe
stockpile
make-shift
"between
jet
defecting
fold
wai
akuku
torlu
insurgency
jakana
berom-christian
nominee
ajiri
waya
academy
rayfield
mata
sabuwa
daudu
ukpam
tsekenyi
umenger
kaseyo
ukar
uvir
idoma
versa
suswam
scientist
entry
grade
laboratory
professional
anyii
giwa
fauri
judicially
subsequent
revise
10pm
birni
hawul
alushi
irregular
unilag
yabatech
asup
agasha
bedc
constituent
rantya
thirty-five
civilian/combatant
pankshin
kanke
giza
marginalization
merchant
zurmi
rustling
dei-dei
ilesa
misconduct
arraignment
ediba
abi
2pm
marama
fairly
ojota
amuwo
odofin
festac
ikedc
midst
viewing
"undue
chembe
ifer
tse
crush
terwase
free-for-all
nwokyo
besan
otutu
obaseki
auditorium
fairness
tussle
azagba
uhunmwode
darazo
principal
vandeikya
sabongari
nasfat
hired
lady
maradun
egan
gwandara
defraud
accumulate
south-west
embarked
suit
file
ajimobi
coeasu,
hot
fountain
ijoko
organizational
lower
kayamla
non-governmental
5pm
ekeremor
bassa
rukuba
irigwe
asokoro
seven-year-old
unconditional
sanga
ogbolomabiri
middle-aged
egba
letter
ndoni
omoku
marina
victimisation
disinvestment
bishop
sallah
dinya
kakuri
knowledge
anlca
tariff
import
gwani
cda
subject
ibara
commence
5am
liaison
nup
ahmadu
commanding
bita
10am
agrarian
pickup
aguata
error
barricaded
statement
patience
sudden
dekina
thwart
lane
positive
grassroots
detergent
oau)
kick
nut
ladoke
akintola
tinubu
kimba
gur
universitys
garage
clad
attires
tertiary
kubwa
gubta
barmo
misau
eku
nuat
attagara
umuapu
mainland
observer
bua
articulate
asleep
causalities/injuries
bringbackourgirls
ebute
meta
musari
wagiri
nuwari
assaults
kanari
wazarde
gula
shaffa
remainder
brothel
acquire
stakeholder
remit
annual
budget
goshe
agapalwa
aganado
aganjara
agabura
difficulty
biafran
ijegun
waterside
reservation
paiko
rpgs
punch
paper
clarify
wrongly
impute
sanusi
sanusis
nlm)
zoning
tasued
ijagun
odogbolu
chaos
bail
anti-justice
daisy
candidacy
stf
upward
pre-daylight
6am
defection
abayawo
alore
ode
adana
omoda
ode-alawusa
okelele
ebba
alawusa
asa
ukwa
"kingpin
bbc
emanate
gsm
askira
uba
ishiagu
kwarangilam
lease
iwo
"gross
ikoyi
hussaini
kwaranglum
tsaha
all-terrain
askira/uba
chuha
korongilim
foodstuff
livestock
7am
phedc
kaibi
nandu
kadamu
kobin
ngaura
naidu
kabamu
hayin
kwanta
kabani
heardmen
emab
plaza
maihula
gwantu
ohaukwu
environment
sanitation
noun)
kautikari
kwada
territorial
keffi
initiate
lopsided
armament
degenerate
larger
nhrc
brt
continuation
golf
volkswagen
[boko
haram]
balmo
miyanti
kerenoa
gashaka
funaab)
rector
gbodo
obunagha
gbarain-ubie
kwatara
etche
dalwa
appropriation
windscreen
iyana
tough
cpyv
alakija
zamadede
pil-gani
faransa
organized
huyum
fast
akwanga
presidency
"piling
interpret
saha
bulabuli-pegi
jos-north
organizer
vest
bujimirum
katarko
safely
garkida
zani
mubeng
hing
lubu
gulani
strap
tundun
"taken
tashan
enroll
idu
deeyor
deken
gokana
"neglect
incentive
delwa
wanga
manga
mustafari
"early
48-hour
"dozens
kirawa
dampar
gwaza
doron
conscript
okpe
debt
rotimi
rumueprikom
wimpey
rumueme
diobu
reduction
iba
okomoko
egwi
ulakwo
desire
supremacy
solider
ala
ebola
disease
forward
retake
eggos
beginning
detailed
overtakes
hover
backlog
kafin
keke
fulani/alagoa
tudun-ababu
wamba
exclusively
assakio
adabu
dedere
desert
miringa
lcda
jibwhiwhui
"very
alongside
airstrike
brewery
kabba-bunu
otuoke
admission
ibedc
duhu
kirshinga
"other
entirety
kofa
kundubau
fura
girke
fegin
mahe
gangara
kukar
gandu
kanawa
lafiya
akuzo
zamfarawar
damba
"fierce
sensitive
starvation
bazza
labourer
"massive
35km
casuality
downed
fate
beheading
reside
afe
babalola
midday
external
creation
double
taxation
baaza
extensive
benisheikh
villiagers
yero
kaibi)
governor-elect
fayose
shindiffu
"melee
shima
mbatsoho
mballagh
kubi
watu
unemployed
ohaji
lwa
dum
rachit
dyang
sharbutu
rachi
diyan
rakweng
chengye
(varying
exception
teen-aged
vimtim
mobbar
select
"last
dated
"huge
prospective
confiscation
aocoed)
ambushing
nnewi
kankara
matriculation
jamb)
jamb
juth)
nursing
non-accreditation
waga
mangoro
garta
uproot
garta.
sina
sondi
gindin
bwari
conscription
non-academic
cooperative
collector
disappearance
coe
patient
request
ak47
hildi
coastline
koton
karifi
hawker
roll
plenary
nafada
disqualification
demarcate
afam
summit
convene
oko
unjust
pasan
lobby
hong
kontagora
disenfranchisement
reschedule
kanberi
"invade
recognise
kasa
inhumane
discriminatory
three-month
stipend
pelia
killking
precede
resign
nta
nominate
[the
deceive
akpajo
incendiary
civilian-jtf
kareto
(among
departure
garaku
nephew
bajoga
"number
impound
ostensibly
buchi
kabba
lame
ambiguous
gajiganna
lagelu
egbeda
demarcated
lalupon
gumsuri
slave
"past
dauda
mbiama
bayelsas
oron
sugarcane
final
class
pharmacist
saminaka
lere
mwagahvuu
connecting
malari
kantoma
day-long
held
mainari
renovation
benin-lagos
kwatar
investigator
uniben
running
10-year
abam
ama
dss)
casualites
proprietor
napps)
ohaozara
perpatrators
johesu
sontyo
kambari
mbororo
shahu
liddle
kamale
ghumci
kilba-higgi
estimated
aeuede
fulani]
abugbe
okoklo
ogwule
ocholoyan
unruly
johesu)
ohanaeze
yangal
aerial
bombardment
windshield
tsemue
mgbakpa
oragbai
molai
birnin-kudu
synchronised
isiokpo
"unpatriotic
angwuan
jibawa
birnin-gwari
udawa
re-capture
wuro
gyambi
ruwa
empowerment
representation
sdp
agulu
auno
ezebiri
furukama
mkpani
kibiya
hinna
yamaltu/deba
gabchari
jabari
zuntur
gajigana
damakar
kumaliwa
bosso
wanti
jeram
kabrisungul
jubrin
gunda
regrouped
persistent
faa
mongul
gana-rop
tamsu-shehuri
ladi-shehuri
gayaðfa
zang
injuries/fatalities
factionist
twitter
unfit
agence
presse
"more
anguduram
musiye
mudu
hardest
buza
kamla
amirari
martin
elechi
pvcs
abinsi
ramalan
yeros
lg
panbeguwa
kubau
bawa
lg.
corporate
ard
ploy
peaceably
doutchi
incursion
oteri
"intense
"little
hatam
jootar
sho
takowok
haram-caused
khurkasa
belt
reader
"over
mararraba
occupant
ndaba
ransom-taking
burra
internally
idps
"led
(origin
ilase
anti-jega
obanikoro
palmgroove
onipanu
ojuelegba
combat
conscripted
voc
argungu
aluu
assult
afijio
akinmorin
jobele
fiditi
iware
ilora
imini
ogba/egbema/ndoni
okwuzi
gachagar
[apc]
scatter
pelt
ikirun
relationship
olomu
birin
bolawa
dukku
osisioma
unable
dungulbi
alkaleri
kirfi
favourable
logistic
tafawa-balewa
jitar
rogo
qua
iboe
kurungu
vir
abur
agberga
yajiwa
afa
maudori
smaller
balle
obrikom
obior
obor
mobilised
malumfashi
ammo
ita
ore
ekwolobia
vote-rigging
yamteke
kana
ozuoba
bomu
norwa
rumu-osi
mbiabong
etoi
afrique
ndiya
nsit
ubium
etim
ini
scarce
"free
intimidate
engagement
madangho
attendant
ologba
egbas
tebo
xenophobic
abujas
provider
jemaa
landmine
kirinowa
ogbor
uosu
gbudu
ekpan
recruit
idi
tokumbere
wulari
gangala
anguwar
bakwai
jigide
kotorima
lagura
lagina
takum-katsina-ala
takum-kashinbilla
"insurgent
kurmi
"anyone
karin-lamido
barikin
vat
zakukpang
dorong
agge
shore
kakpwis
laraga
ido
sachet
contributory
ropp
"vigilantes
sucide
saleries
inding
itemise
insulting
unfulfilled
iorzaa
ukura
gusa
gafa
adavi
senator-elect
buruji
kashamu
trafficking
abroad
)s
nasir
irepodun
perform
unn)
shutdown
osara
ssg)
shettimari
transporter
automotive
ngar
tungushe
baga/monguno
oshogbo
tarmowa
tarmua
ardo
mid-day
igwanda
ebute-metta
igbo-eze
accusation
katsak
danborno
indict
debiro
flyover
selection
characterise
ssanu
collision
ibeju-lekki
kokiya
abaji
aau)
ekpoma
illorin
terminate
nkerefi
(either
igedes
mainuk
oleh
hambagtha
umuokpu
otolo
ukpo
tombia
affected
kuje
zaki-biam
bida
abetment
tribunal
tadagara
dumbulwa
interference
ikare-akoko
idadan
aramoko-ekiti
drowning
judgement
gudumbali
advance
premium
reinvestment
sure-p)
suleiman
majidun
horseback
alvan
ikoku
impounding
zakupwang
maintenance
disa
balazola
janguoriri
bulatori
celebrate
bitiku
kubu
"poor
"anti-people
ekedc
badia
lai
cheating"
"earlier
exacted
nominated
ajasse
ipo
managing
ibeju/lekki
okunraiye
wuye
ultra-modern
tipper
pro-biafra
pro-biafran
ipob
like-minded
oye
detonation
orile
truck-driving
obot
personality
kauru
garbage
amawbia
pre-meditated
commentator
agojeju
ojeh
ajomojayi
ajadaji
idochi
ojiyanawo
ulaja
oganenigu
trek
nwalemer
mallemiri
boboshe
kardewa
dure
ibop
musician
polaku
jailed
missing
karetu
kumshe
baruten
okuta
ogomne
bwin
gandasunon
kpuru
woru
wuren
kparu
ajuba1
ajuba
saka
yeruman
monta
dotin
halidun
yakubun
sonsi
gunosani
yodo
mankparu
simen
questionable
kanu
omi
adio
onikanga
mabolese
alatori
agbetu
olorode
tangaran
oporoma
take-over
lambata
"onslaught
iran
mangari
zakzaky
ibraheem
el-zakzaky
colonel
aniocha
exploration
ameer
tsragi
bornon
kurku
tsaragi
despatch
mush
imn)
aladuwari
hospitalise
amofia
ngbo
chance
"unabated
isiala-north
gashua
ovade
oghara(fe
"weekend"
insubordination
nararawa
okpaya
idp
opudebubor
okpelama
kpokpo
illicit
mijigine
spat
herders
hamlet
demsare
wunamokoh
dikajam
taboungo
gireri
jawu
encroachment
"economic
dalori
panicked
sheik
mairi
peaceable
okokolo
utukolugwu
traverse
undetected
recuing
"military
fada
dale
wizha
bokko
timit
nasanu
yakshari-12/02
kachifa-13/02
kwal
komala
dole
gajibo
maula
gamai
gamare
warsale
tangli
tushi
sowa
hasanari
changuwa
malamaja
marya
musafanari
gurfata
mortar
uneme
okpella
akwu
adagbo
edumoogbo
egwuma
oladukwu
usha
owetp
ayilla
ogboju
nsdc
"hate
kosofe
doksa
ibafo-mowe
lagos/ibadan
ibafo
overwhelm
obalufe
reconstruction
mobalizied
nyesom
wike
aga
orunto
ifes
unoccupied
golgore
bulasari
civilans
unfavourable
tombo
nimasa
daraga
menari
bulamari
zangebe
maafa
baale
kaltaram
wumbi
tunish
tilem
kala/balge
mulai
madube
dobi
baseõ
joba
mosa
[that
iza
[sic
clearing
mbollena
shamari
otodo
gbame
uneme-ekpedo
bekuma-okpameri
pick
bekuma
yakowa
madawaya
kardile
koujili
ngenere
maksamari
bembem
zombulum
taraji
kyare
kadawu
gineba
bosheri
bula
wannune
"unjust
month-long
maisuma
steeling
apprently
motovated
ugbene
ejuona
haram-clearing
nbaga
dabube
ybiri
greya
suduwa
alimosho
sworn-in
ogali
tarka
dislocation
thatched
kudung
pwel
dawaki
genesis
unmasking
"masquerade
bearing
boyes
clearance
damboa-bale-gwoza
mufurundi
masemari
bego
gadzama
gagantilo
ied)
bicycle
kala
"kingpins
rann
wurkum
shumo
balasa
anti-saraki
ukpabi
nimbo
okigwe
yerwa
adayi
avenger
nda
trunkline
abattoir
igbide
galtha
bulakurma
shatimari
chukruk
bulangaje
nkwagu
guduf
yagwa
gamude
tsakiya
operation(
ideato
biladdili
ojuocha
ayingba
shibiri
etegbin
sands
pandongari
49th
ikom
tseaondo
tseantyo
"high-handedness
sabsawa-boarding
bocobs-ngurusoye
1st-2nd
privatization
chukungudu
ogbe-ijoh
aladja
nut)
constitutional
ambode
kircha
goniye
wujjah
alkelu
kita
jiddum
jameri
geri
jabe
percentage
carryout
mulfuta
baibawa
jenere
kafie
bodi
bulagana
gambori
bitta-damboa
